{
    "Home": "الرئيسيه",
    "Grammar": "قواعد",
    "Basics": "الأساسيات",
    "Tenses": "الأزمنة",
    "Idioms": "مصطلحات",
    "Prepositions": "حروف الجر",
    "Vocabulary": "كلمات",
    "Past Tense": "زمن الماضي",
    "Past Simple": "الماضي البسيط",
    "Past Continuous": "الماضي المستمر",
    "Past Perfect": "الماضي التام",
    "Present Tense": "زمن الحاضر",
    "Future tense": "زمن المستقبل",
    "Collocations": "المتلازمات",
    "Phrasal verbs": "أشباه الجمل الفعلية",
    "Idioms expressions": "التعبيرات الاصطلاحية",
    "Affirmative": "اثبات",
    "Negative": "نفي",
    "Interrogative": "استفهام",
    "Examples": "أمثلة",

    "Search": "بحث",
    "Uses": "الاستخدامات",
    "auxiliary": "مساعد",
    "main": "اساسي",
    "Name": "الاسم",
    "Details": "تفاصيل",
    "Choose Collocations Type": "اختر نوع الارتباطات",
    "Update Collocations": "تحديث الترابطات",
    "Add Collocation": "اضافه ترابط",
    "What is a collocation?": "ما هو التجميع؟",
    "What is Phrasal verbs?": "ما هي أشباه الجمل الفعلية?",
    "Why learn collocations?": "لماذا تعلم التجميعات؟",
    "Types of collocation?": "?أنواع التجميع",

    "A tense expressing an action that has happened or a state that previously existed.": "زمن يعبر عن فعل حدث أو حالة كانت موجودة من قبل.",
    "A tense expressing an action that is currently going on or habitually performed, or a state that currently or generally exists.": "زمن يعبر عن فعل يجري حاليًا أو يتم إجراؤه بشكل معتاد ، أو حالة موجودة حاليًا أو موجودة بشكل عام.",
    "A tense expressing an action that has not yet happened or a state that does not yet exist.": "زمن يعبر عن فعل لم يحدث بعد أو حالة لم تكن موجودة بعد.",

    "A collocation is two or more words that often go together. These combinations just sound \"right\" to native English speakers, who use them all the time. On the other hand, other combinations may be unnatural and just sound \"wrong\".": "التجميع هو كلمتان أو أكثر غالبًا ما يتم الجمع بينهما. تبدو هذه التركيبات 'صحيحة' للمتحدثين الأصليين للغة الإنجليزية ، الذين يستخدمونها طوال الوقت. من ناحية أخرى ، قد تكون التركيبات الأخرى غير طبيعية ويبدو أنها 'خاطئة'.",
    "Your language will be more natural and more easily understood.": "ستكون لغتك طبيعية أكثر وأكثر سهولة في الفهم.",
    "You will have alternative and richer ways of expressing yourself.": "سيكون لديك طرق بديلة وأكثر ثراءً للتعبير عن نفسك.",
    "It is easier for our brains to remember and use language in chunks or blocks rather than as single words.": "من الأسهل على أدمغتنا أن تتذكر اللغة وتستخدمها في أجزاء أو أجزاء بدلاً من كلمات مفردة.",
    "There are several different types of collocation made from combinations of verb, noun, adjective etc. Some of the most common types are": "هناك عدة أنواع مختلفة من التجميع المصنوع من مجموعات من الفعل والاسم والصفة وما إلى ذلك. بعض الأنواع الأكثر شيوعًا هي",
    "Phrasal verbs are very common in English, especially in more informal contexts. They are made up of a verb and a particle or, sometimes, two particles. The particle often changes the meaning of the verb.": "أشباه الجمل الفعلية شائعة جدًا في اللغة الإنجليزية ، خاصة في السياقات غير الرسمية. وهي مكونة من فعل وجسيم ، وأحيانًا من جسيمين. غالبًا ما يغير الجسيم معنى الفعل.",

    "the event is": "الحدث",
    "in the past": "في الماضي",
    "completely finished": "انتهت تماما",
    "we say (or understand) the": "نقول (أو نفهم)",
    "of the event": "من الحدث",
    "A: For positive sentences": "ا : للجمل الإيجابية",
    "B: For negative sentences": "ب : للجمل السلبية",
    "C: For question sentences": "ت : لجمل السؤال",
    "B: For negative and question sentences:": "B: بالنسبة للجمل السلبية وجمل السؤال:",

    "There is no auxiliary verb": "لا يوجد فعل مساعد",
    "The main verb is conjugated in the Past Simple, invariable: -ed (or irregular)": "الفعل الرئيسي مترافق في الماضي بسيط ، ثابت: -ed (أو غير منتظم)",
    "A: Repetition (often, sometimes, always):": "A: التكرار (غالبًا ، أحيانًا ، دائمًا):",
    "The auxiliary is conjugated in the Past Simple, invariable: did": "المساعد مترافق في الماضي بسيط ، ثابت: did",
    "For question sentences, we exchange the subject and the auxiliary verb": "لجمل السؤال ، نقوم بتبادل الفاعل والفعل المساعد",
    "The main verb is invariable in base form: base": "الفعل الرئيسي ثابت في الشكل الأساسي: القاعدة",
    "For negative sentences, we insert not between the auxiliary verb and main verb": "بالنسبة للجمل السلبية ، لا ندرج بين الفعل المساعد والفعل الرئيسي",
    "Past Simple with the main verb be :": "هيكل الماضي البسيط مع (v) be",
    "There is no auxiliary verb, even for questions and negatives": "لا يوجد فعل مساعد ، حتى بالنسبة للأسئلة والسلبيات",
    "The main verb (be) is conjugated in the Past Simple": "يتم تصريف الفعل الرئيسي (be) في",
    "For negative sentences, we insert not after the main verb": "بالنسبة للجمل السلبية ، فإننا لا ندخلها بعد الفعل الرئيسي",
    "For question sentences, we exchange the subject and the main verb": "لجمل السؤال ، نقوم بتبادل الفاعل والفعل الرئيسي",
    "Tags": "الكلمات الدلاليه",
    "is": "يكون",
    "I": "أنا",
    "sometimes walked": "امشي في بعض الأحيان",
    "home at lunchtime": "الي المنزل في وقت الغداء",
    "often brought": "في كثير من الأحيان",
    "my lunch to school": "احضر غذائي إلى المدرسة",
    "B: Specific point in time  (last week, when I was a child, yesterday, six weeks ago):": "B: نقطة زمنية محددة (الأسبوع الماضي ، عندما كنت طفلاً ، أمس ، قبل ستة أسابيع):",
    "We saw a good film": "شاهدنا فيلما جيدا",
    "last week": "الأسبوع الماضي",
    "Yesterday": "في الامس",
    "I arrived in Geneva": "وصلت إلى جنيف",
    "She finished her work": "أنهت عملها",
    "I went to the theatre": "ذهبت إلى المسرح",

    "Look at these examples with the main verbs": "انظر إلى هذه الأمثلة بالأفعال الرئيسية",
    "From the above table, notice the following points": "من الجدول أعلاه ، لاحظ النقاط",

    "The past simple  is used to talk about events that occurred in the past at a specific time.": "يستخدم الماضي البسيط للتحدث عن أحداث وقعت في الماضي في وقت محدد.",
    "How do we make the Past Simple": "كيف نفعل صيغة الماضي البسيط",

    "We use the past continuous is used to talk about actions and events that lasted for a specific period of time in the past.": "نستخدم الماضي المستمر للتحدث عن الأفعال والأحداث التي استمرت لفترة زمنية محددة في الماضي.",
    "The structure of the past continuous tense is :": "هيكل الماضي المستمر هو :",
    "How do we make the Past Continuous": "كيف نفعل صيغة الماضي المستمر",

    "We used the past perfect refers to a time earlier than before now. It is used to make it clear that one event happened before another in the past.": "استخدمنا الماضي التام يشير إلى وقت أقدم من ذي قبل الآن. يتم استخدامه لتوضيح أن حدثًا وقع قبل الآخر في الماضي.",
    "The past perfect is used to refer to an earlier time than before. It is used to show that an event occurred before another event in the past. Any of the events can be placed, as the sentence's tense denotes the order.": "يستخدم الماضي التام للإشارة إلى وقت أبكر من ذي قبل. يتم استخدامه لإظهار أن حدثًا قد وقع قبل حدث آخر في الماضي. يمكن وضع أي من الأحداث ، حيث يشير زمن الجملة إلى الترتيب.",
    "How do we make the Past Perfect": "كيف نجعل صيغة الماضي بسيطة",
    "The structure of the past perfect tense is :": "هيكل الماضي التام هو :",
    "It takes the auxiliary verb (had).": "يأخذ الفعل المساعد (had).",
    "When adding not with the auxiliary verb had, we shorten it, so it": "عند جمع (not) مع الفعل المساعد ، قمنا بتقصيره ، لذلك هو",
    "We put": "نضع",
    "at the beginning of the sentence and then complete it as is. Below is a table.": "في بداية الجملة ثم أكملها كما هي. يوجد أدناه جدول.",
    "The answer to this summer's Interrogative question is": "الجواب على السؤال هو",
    "In a question (w), we put the tool": "في السؤال (w) نضع الأداة",
    "at the beginning of the question, then had, then the subject, followed by the clarification.": "في بداية السؤال ، ثم الموضوع ، يليه التوضيح.",

    "meaning when the simple past tense comes after it:": "المعنى عندما يأتي الفعل الماضي البسيط بعده:",
    "(As) / (when) I arrived the station, the train": "عندما / (عندما)  وصلت إلى المحطة القطار",
    "already left as (when) I arrived the station.": "غادر بالفعل (عندما) وصلت إلى المحطة.",
    "after her comes a perfect past:": "يأتي بعدها ماضٍ تام:",
    "The car crashed because": "تحطمت السيارة بسبب",
    "I had driven": "لقد قدت السيارة",
    "so fast.": "سريع جدا.",

    "Because I had not": "لأنني لم ",
    "studied hard, I failed the test.": "ادرس بجد ، لقد فشلت في الاختبار.",
    "She went to the hospital because": "ذهبت إلى المستشفى ﻷنها",
    "she had poisoned herself.": "سممت نفسها.",
    "I had eaten an apple": "ان أكلت تفاحة",
    "before": "قبل",
    "after":"بعد",
    "I went to school yesterday.": "ذهابي إلى المدرسة أمس.",
    "I went to school": "ذهبت الى المدرسة",
    "The train had": "كان القطار"

}
